www/src/thunks/book-recs-4-russ.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>book-recs-4-russ</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="book-recs-4-russ"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-18 08:53:20 EST"/>
<meta name="author" content="mfogus"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">book-recs-4-russ</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Books recommended to Russ</a>
<ul>
<li><a href="#sec-1-1">1.1 LISP in Small Pieces</a></li>
<li><a href="#sec-1-2">1.2 The Recursive Universe</a></li>
<li><a href="#sec-1-3">1.3 Bootstrapping: Douglas Engelbart, Coevolution, and the Origins of Personal Computing</a></li>
<li><a href="#sec-1-4">1.4 Patterns of Software: Tales from the Software Community</a></li>
<li><a href="#sec-1-5">1.5 The Computer and the Brain (by von Neumann)</a></li>
<li><a href="#sec-1-6">1.6 Write Yourself a Scheme in 48 Hours</a></li>
<li><a href="#sec-1-7">1.7 Mindstorms: Children, Computers, And Powerful Ideas</a></li>
<li><a href="#sec-1-8">1.8 ML for the Working Programmer</a></li>
<li><a href="#sec-1-9">1.9 Dreaming in Code</a></li>
<li><a href="#sec-1-10">1.10 Essentials of Programming Languages</a></li>
<li><a href="#sec-1-11">1.11 Masters of Doom</a></li>
<li><a href="#sec-1-12">1.12 The Joy of Clojure, 2nd edition</a></li>
<li><a href="#sec-1-13">1.13 A Programming Language (by Iverson)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Books recommended to Russ</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> LISP in Small Pieces</h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> The Recursive Universe</h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Bootstrapping: Douglas Engelbart, Coevolution, and the Origins of Personal Computing</h3>
<div class="outline-text-3" id="text-1-3">

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Patterns of Software: Tales from the Software Community</h3>
<div class="outline-text-3" id="text-1-4">

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> The Computer and the Brain (by von Neumann)</h3>
<div class="outline-text-3" id="text-1-5">

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> <a href="http://en.wikibooks.org/wiki/Write_Yourself_a_Scheme_in_48_Hours">Write Yourself a Scheme in 48 Hours</a></h3>
<div class="outline-text-3" id="text-1-6">

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Mindstorms: Children, Computers, And Powerful Ideas</h3>
<div class="outline-text-3" id="text-1-7">

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> ML for the Working Programmer</h3>
<div class="outline-text-3" id="text-1-8">

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Dreaming in Code</h3>
<div class="outline-text-3" id="text-1-9">

</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Essentials of Programming Languages</h3>
<div class="outline-text-3" id="text-1-10">

</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Masters of Doom</h3>
<div class="outline-text-3" id="text-1-11">

</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> The Joy of Clojure, 2nd edition</h3>
<div class="outline-text-3" id="text-1-12">

</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> A Programming Language (by Iverson)</h3>
<div class="outline-text-3" id="text-1-13">


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-12-18 08:53:20 EST</p>
<p class="author">Author: mfogus</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
